// 九价疫苗
auto.waitFor();

var appName = "约苗";
// 启动目标软件
launchApp(appName);

second = 1000;
sleep(5*second); // 设置等待时间，以免启动太慢

// 雷电模拟器
filePath = "/storage/emulated/0/脚本/yimiaoInfo.txt";

// 手机
// filePath = "/手机存储/脚本/yimiaoInfo.txt";
cityList = ['北京市', '七台河市', '三亚市', '三明市', '三沙市', '上饶市', '东莞市', '东营市', '中卫市', '中山市', '临汾市', '临沂市', '临沧市', '丹东市', '丽水市', '丽江市', '乌海市', '乐山市', '九江市', '云浮市', '亳州市', '伊春市', '佛山市', '保定市', '保山市', '信阳市', '六安市', '兰州市', '兴安盟', '内江市', '包头市', '北海市', '十堰市', '南京市', '南宁市', '南平市', '南昌市', '南通市', '南阳市', '厦门市', '台州市', '台湾省', '合肥市', '吉安市', '吉林市', '吕梁市', '周口市', '咸宁市', '唐山市', '商丘市', '商洛市', '嘉兴市', '四平市', '固原市', '大同市', '大庆市', '大连市', '天水市', '威海市', '娄底市', '孝感市', '宁德市', '宁波市', '安庆市', '安康市', '安阳市', '安顺市', '宜宾市', '宜昌市', '宜春市', '宝鸡市', '宣城市', '宿州市', '宿迁市', '岳阳市', '崇左市', '巴中市', '常州市', '常德市', '平凉市', '广元市', '广州市', '庆阳市', '廊坊市', '开封市', '张掖市', '徐州市', '德州市', '忻州市', '怀化市', '惠州市', '成都市', '扬州市', '承德市', '抚州市', '抚顺市', '拉萨市', '新乡市', '新余市', '无锡市', '日照市', '昆明市', '昭通市', '晋中市', '晋城市', '普洱市', '曲靖市', '朝阳市', '本溪市', '来宾市', '杭州市', '松原市', '枣庄市', '柳州市', '株洲市', '桂林市', '梅州市', '梧州市', '榆林市', '武威市', '武汉市', '永州市', '汉中市', '汕头市', '汕尾市', '江门市', '池州市', '沈阳市', '沧州市', '河池市', '河源市', '泉州市', '泰安市', '泰州市', '泸州市', '洛阳市', '济南市', '济宁市', '海口市', '淄博市', '淮北市', '淮南市', '淮安市', '深圳市', '清远市', '温州市', '渭南市', '湖州市', '湘潭市', '湛江市', '滁州市', '滨州市', '漯河市', '漳州市', '潍坊市', '潮州市', '濮阳市', '烟台市', '焦作市', '玉林市', '玉溪市', '珠海市', '白城市', '白山市', '白银市', '百色市', '益阳市', '盐城市', '盘锦市', '眉山市', '福州市', '绍兴市', '绥化市', '绵阳市', '聊城市', '肇庆市', '自贡市', '舟山市', '苏州市', '茂名市', '荆州市', '荆门市', '莆田市', '莱芜市', '菏泽市', '萍乡市', '营口市', '蚌埠市', '衡水市', '衡阳市', '衢州市', '襄阳市', '西宁市', '西安市', '许昌市', '贵港市', '贺州市', '资阳市', '赣州市', '赤峰市', '辽源市', '辽阳市', '达州市', '运城市', '通化市', '通辽市', '遂宁市', '遵义市', '邢台市', '邯郸市', '邵阳市', '郑州市', '郴州市', '鄂州市', '酒泉市', '金华市', '金昌市', '钦州市', '铁岭市', '铜川市', '铜陵市', '银川市', '锦州市', '镇江市', '长春市', '长沙市', '长治市', '阜新市', '阜阳市', '阳江市', '阳泉市', '陇南市', '随州市', '雅安市', '青岛市', '鞍山市', '韶关市', '鸡西市', '鹤壁市', '鹤岗市', '鹰潭市', '黄冈市', '黄山市', '黄石市', '黑河市', '龙岩市', '七台河市', '三门峡市', '佳木斯市', '六盘水市', '双鸭山市', '和田地区', '哈尔滨市', '喀什地区', '嘉峪关市', '塔城地区', '平顶山市', '张家口市', '张家界市', '攀枝花市', '景德镇市', '牡丹江市', '石嘴山市', '石家庄市', '秦皇岛市', '葫芦岛市', '连云港市', '阿拉善盟', '阿里地区', '马鞍山市', '驻马店市', '乌兰察布市', '乌鲁木齐市', '克拉玛依市', '呼伦贝尔市', '呼和浩特市', '巴彦淖尔市', '鄂尔多斯市', '锡林郭勒盟', '阿克苏地区', '阿勒泰地区', '齐齐哈尔市', '大兴安岭地区', '临夏回族自治州', '凉山彝族自治州', '大理白族自治州', '昌吉回族自治州', '果洛藏族自治州', '楚雄彝族自治州', '海南藏族自治州', '澳门特别行政区', '玉树藏族自治州', '甘南藏族自治州', '甘孜藏族自治州', '迪庆藏族自治州', '黄南藏族自治州', '伊犁哈萨克自治州', '延边朝鲜族自治州', '怒江傈僳族自治州', '巴音郭楞蒙古自治州', '文山壮族苗族自治州', '西双版纳傣族自治州', '阿坝藏族羌族自治州', '德宏傣族景颇族自治州', '恩施土家族苗族自治州', '海西蒙古族藏族自治州', '湘西土家族苗族自治州', '红河哈尼族彝族自治州', '黔东南苗族侗族自治州', '黔南布依族苗族自治州', '克孜勒苏柯尔克孜自治州', '黔西南布依族苗族自治州']

// 先切换城市，再进入秒杀窗口（操作步骤多些）
function getCity(){
    console.show();
    for(var i=0; i<cityList.length;i++){
        console.log(cityList[i]);
        id("city_tv").findOne().click();
        sleep(2*second);
        // 点击搜索框
        id("search").findOne().click();
        sleep(2*second);
        // 输入搜索内容
        setText([0],cityList[i]);
        sleep(2*second);
        click(cityList[i]);
        sleep(2*second);
        click("确定");
        sleep(2*second);
        // click("疫苗秒杀");
        id("imageView6").findOne().click()
        sleep(2*second);
        back();
    }
}

// 先进入秒杀窗口，再切换城市（操作步骤少些）
function getCity2(){
    console.show();

    sleep(2*second);
    // "疫苗秒杀"
    id("imageView6").findOne().click()
    sleep(2*second);
    
    cityListLength = cityList.length
    for(var i=0; i<cityListLength; i++){
        console.log(cityList[i], i, cityListLength, cityListLength-i);
        id("city_tv").findOne().click();
        sleep(2*second);
        // 点击搜索框
        id("search").findOne().click();
        sleep(2*second);
        // 输入搜索内容
        setText([0],cityList[i]);
        sleep(2*second);
        click(cityList[i]);
        sleep(2*second);
        click("确定");
        sleep(second)

        if(id("textView86").exists()){
            continue;
        }else{
            saveInfo(cityList[i]);
        }
    }
}

function saveInfo(city){
    nameList = id("name").untilFind();
    shotList = id("shot").untilFind();
    departmentList = id("department").untilFind();
    timeList = id("time").untilFind();
    for(var i=0;i<nameList.length;i++){
        fileText = city + "\t" + nameList[i].text() +"\t"+ shotList[i].text() +"\t"+
        departmentList[i].text() +"\t"+ timeList[i].text()+"\n";
        files.append(filePath, fileText);

        console.log(fileText);
    }
}

getCity2();
// saveInfo();